'''
3
30
50
70

10 - 1
1

20 - 3
11
=
ㅁ

30  - 5
111
1=
1ㅁ
=1
ㅁ1

40 - 11
1111
11=
11ㅁ
1=1
1ㅁ1
ㅁ11
ㅁ=
ㅁㅁ
=11
=ㅁ
==

40
----    1111 1
1개
--ㅁ    11= 11ㅁ 2
-ㅁ-    1=1 1ㅁ1 2
ㅁ--    =11 ㅁ11 2
6개 2*3
ㅁㅁ     == =ㅁ ㅁ= ㅁㅁ 4
2^2*1
11

50
-----   11111
1개
ㅁ--- ` =111 ㅁ111  2
-ㅁ--   1=11 1ㅁ11  2
--ㅁ-   11=1 11ㅁ1  2
---ㅁ   111= 111ㅁ  2
8개 2*4
ㅁㅁ-   ==1 =ㅁ1 ㅁ=1 ㅁㅁ1  4
ㅁ-ㅁ   =1= =1ㅁ ㅁ1= ㅁ1ㅁ  4
-ㅁㅁ   1== 1=ㅁ 1ㅁ= 1ㅁㅁ  4
12개 2^2*3
21개

60
------  111111
1개
ㅁ----   ㅁ1111 =1111
-ㅁ---   1ㅁ111 1=111
--ㅁ--   11ㅁ11 11=11
---ㅁ-   111ㅁ1 111=1
----ㅁ   1111ㅁ 1111=
10개 2*5
ㅁㅁ--    ㅁㅁ11 ㅁ=11 =ㅁ11 ==11
ㅁ-ㅁ-    =1=1 =1ㅁ1 ㅁ1=1 ㅁ1ㅁ1
ㅁ--ㅁ    =11= =11ㅁ ㅁ11= ㅁ11ㅁ
-ㅁㅁ-    1==1 1=ㅁ1 1ㅁ=1 1ㅁㅁ1
-ㅁ-ㅁ    1=1= 1=1ㅁ 1ㅁ1= 1ㅁ1ㅁ
--ㅁㅁ    11== 11=ㅁ 11ㅁ= 11ㅁㅁ
24개 2*2*6
ㅁㅁㅁ     ㅁㅁㅁ ㅁㅁ= ㅁ=ㅁ =ㅁㅁ ㅁ== ==ㅁ =ㅁ= ==ㅁ ===
8개 2^2^2*1
43개

배치할 수 있는 경우의 수  N//20 + 1
쓸수 있는 것 = N
N//10 N//20
range(1, N//10+1, 2) 1,3,5,7
range(N//20, -1, -1) 3,2,1,0

abbb babb bbab bbba
aaabb aabab aabba abaab ababa abbaa bbaaa babaa baaba baaab
abbb babb bbab bbba
20과 10의 조합?


70 - [10 20 20 20] [10 10 10 20 20] [10 10 10 10 10 20] [10 10 10 10 10 10 10]
------- 1111111
1개
ㅁ-----  =11111 ㅁ11111
-ㅁ----  1=1111 1ㅁ1111
--ㅁ---  11=111 11ㅁ111
---ㅁ--  111=11 111ㅁ11
----ㅁ-  1111=1 1111ㅁ1
-----ㅁ  11111= 11111ㅁ
12개 2*6
ㅁㅁ---   ==111 =ㅁ111 ㅁ=111 ㅁㅁ111
ㅁ-ㅁ--   =1=11 =1ㅁ11 ㅁ1=11 ㅁ1ㅁ11
ㅁ--ㅁ-   =11=1 =11ㅁ1 ㅁ11=1 ㅁ11ㅁ1
ㅁ---ㅁ   =111= =111ㅁ ㅁ111= ㅁ111ㅁ
-ㅁㅁ--   1==11 1=ㅁ11 1ㅁ=11 1ㅁㅁ11
-ㅁ-ㅁ-   1=1=1 1=1ㅁ1 1ㅁ1=1 1ㅁ1ㅁ1
-ㅁ--ㅁ   1=11= 1=11ㅁ 1ㅁ11= 1ㅁ11ㅁ
--ㅁㅁ-   11==1 11=ㅁ1 11ㅁ=1 11ㅁㅁ1
--ㅁ-ㅁ   11=1= 11=1ㅁ 11ㅁ1= 11ㅁ1ㅁ
---ㅁㅁ   111== 111=ㅁ 111ㅁ= 111ㅁㅁ
40개 2^2*10
ㅁㅁㅁ-    ===1 ==ㅁ1 =ㅁ=1 ㅁ==1 =ㅁㅁ1 ㅁ=ㅁ1 ㅁㅁ=1 ㅁㅁㅁ1
ㅁㅁ-ㅁ    ==1= ==1ㅁ =ㅁ1= ㅁ=1= =ㅁ1ㅁ ㅁ=1ㅁ ㅁㅁ1= ㅁㅁ1ㅁ
ㅁ-ㅁㅁ    =1== =1=ㅁ =1ㅁ= ㅁ1== =1ㅁㅁ ㅁ1=ㅁ ㅁ1ㅁ= ㅁ1ㅁㅁ
-ㅁㅁㅁ    1=== 1==ㅁ 1=ㅁ= 1ㅁ== 1=ㅁㅁ 1ㅁ=ㅁ 1ㅁㅁ= 1ㅁㅁㅁ
32개 2^2^2*4
85개

점화식
N번째는 (N-1)+(N-2)*2
'''
ans_dict = {10: 1, 20: 3, 30: 5}
for i in range(30, 301, 10):
    ans_dict[i] = ans_dict[i-20] * 2 + ans_dict[i - 10]
print(ans_dict)
for tc in range(1, 1 + int(input())):
    N = int(input())
    print(f'#{tc} {ans_dict[N]}')
