'''
01이 10보다 많으면 00먼저 뽑고 01 하나 뽑아서 같게 만들고 11 다 뽑고 10 01 반복 1 2 1 1
00 01 11 10 01

10이 01보다 많으면 11 먼저 뽑고 10 하나 뽑아서 같게 만들고 00 다 뽑고 01 10 반복 1 1 2 1
11 10 00 01 10

같으면 걍 출력하면 됨 1 2 2 1
00 01 11 10 01 10

01이 0이면 1 0 1 1 11부터 출력
11 10 00

10 이 0이면 00부터 출력
00 01 11

FF = 00
TT = 11
TF = 10
FT = 01

TF와 FT의 차이가 2 이상일 경우 답이 없음
(01x) 01 01 10

TT, FF가 존재할 때 TF FT둘중 하나도 없으면 답이 없음

10
2 1 0 2
2 0 1 2
4 3 2 1
1 2 3 4
2 2 2 2
1 0 0 1
0 1 3 0
1 0 0 0
0 0 0 1
0 0 0 0

'''


for t in range(int(input())):

    FF, FT, TF, TT = map(int, input().split(" "))
    # print(FF, FT, TF, TT)
    ans = 0

    if FT == TF == 0 != (TT and FF):
        # N 0 0 N, 1 0 0 1
        print(f'#{t + 1} impossible')  # imp
    elif FT not in [TF - 1, TF, TF + 1]:
        print(f'#{t + 1} impossible')
    else:
        if FT == TF == TT == 0:
            ans = '0' + '0' * FF
            # 3 0 0 0
            # 00 00 00
            # 0000
        elif FT == TF == FF == 0:
            ans = '1' + '1' * TT
            # 0 0 0 3
            # 11 11 11
            # 1111

        elif TF == 0:
            ans = '0' + '0' * FF + '1' * TT + '1'
            # 2 1 0 2
            # 00 00 01 11 11
            # 000111
        elif FT == 0:
            ans = '1' + '1' * TT + '0' + '0' * FF
            # 2 0 1 2
            # 11 11 10 00 00
            # 111000

        elif FT == TF + 1:
            ans = '0' + '0' * FF + '1' * TT + '10' * TF + '1'
            # 4 3 2 1
            # 00 00 00 00 01 11 10 01 10 01
            # 00000110101
        elif FT == TF - 1:
            ans = '1' + '1' * TT + '0' * FF + '01' * FT + '0'
            # 1 2 3 4
            # 11 11 11 10 00 01 10 01 10
            # 11111001010
        elif FT == TF:
            ans = '0' + '0' * FF + '1' * TT + '10' * TF
            # 2 2 2 2
            # 00 00 01 11 11 10 01 10
            # 000111010

        print(f'#{t + 1} {ans}')